# Queries: Sakila (Core)

## Assignment:

- Create a new repository and notebook for this assignment.
- Using the Sakila database, complete the below queries with Python in your Jupyter Notebook.
    - You can use MySQL Workbench to test your queries and then copy and paste them into your notebook to perform with Pandas and SQLAlchemy.
- You can get the Sakila database and ERD here (sakila-data.sql and sakila-db-model.png), please use these for reference.
    - Tip: you can insert the ERD into your notebook in a Markdown cell using: "![png](IMAGE_URL_HERE)"
    - Replace "IMAGE_URL_HERE" with the link to the ERD above.

### Tasks:

Queries
1. What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

2. What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

3. What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

5. What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

6. What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

- After performing all of your queries and displaying the answers to each question, save your notebook, commit the change to your repository and submit the repository URL for this assignment.

**Note:** Even if you get stuck on a query, please submit your attempts to document your efforts!

 ![png](https://assets.codingdojo.com/boomyeah/company_209/chapter_3569/handouts/chapter3569_5431_sakila-db-model.png)

In [1]:
import pandas as pd
import numpy as np

## PyMySQL

In [7]:
from sqlalchemy.engine import create_engine

import pymysql
pymysql.install_as_MySQLdb()

from urllib.parse import quote_plus

username = "root"
password = quote_plus("@Bulldawgs10")

db_name = "sakila"

In [8]:
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'

engine = create_engine(connection)

In [9]:
q = """SELECT * FROM actor;"""
pd.read_sql(q, engine)

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-14 12:34:33
1           2       NICK      WAHLBERG 2006-02-14 12:34:33
2           3         ED         CHASE 2006-02-14 12:34:33
3           4   JENNIFER         DAVIS 2006-02-14 12:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-14 12:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-14 12:34:33
196       197      REESE          WEST 2006-02-14 12:34:33
197       198       MARY        KEITEL 2006-02-14 12:34:33
198       199      JULIA       FAWCETT 2006-02-14 12:34:33
199       200      THORA        TEMPLE 2006-02-14 12:34:33

[200 rows x 4 columns]

## Queries

### 1. 
What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [10]:
q_1= """SELECT customer.first_name, customer.last_name, customer.email, address.address, city.city
        FROM customer
        JOIN city ON customer.customer_id = city.country_id
        JOIN address ON customer.store_id = address.city_id
        WHERE city.city_id = 312; """

pd.read_sql(q_1, engine)

,first_name,last_name,email,address,city
0,CRYSTAL,FORD,CRYSTAL.FORD@sakilacustomer.org,939 Probolinggo Loop,London

### 2.
What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

In [11]:
q_2= """SELECT film.title, film.description, film.release_year, film.rating, film.special_features
        FROM film
        JOIN category ON film.film_id = category.category_id
        WHERE category.name = "comedy";"""

pd.read_sql(q_2, engine)

,title,description,release_year,rating,special_features
0,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,G,Deleted Scenes

### 3. 
What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [12]:
q_3= """SELECT actor.last_name, film.title, film.release_year
        FROM actor
        JOIN film ON actor.actor_id = film.film_id
        WHERE first_name = 'Johnny' AND last_name = 'Lollobrigida'"""

pd.read_sql(q_3, engine)

      last_name        title  release_year
0  LOLLOBRIGIDA  AFRICAN EGG          2006

### 4. 
What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [16]:
q_4= """SELECT actor.first_name, actor.last_name
        FROM actor
        JOIN film ON actor.actor_id = film.film_id
        WHERE title = 'BINGO TALENTED';"""

pd.read_sql(q_4, engine)

  first_name last_name
0       GARY      PENN

### 5.
What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [25]:
q_5= """SELECT customer_id, 2*AVG(amount) AS Amount
        FROM payment
        GROUP BY customer_id"""

pd.read_sql(q_5, engine)

     customer_id     Amount
0              1   7.417500
1              2   9.535556
2              3  10.441538
3              4   7.434545
4              5   7.611579
..           ...        ...
594          595   7.846667
595          596   6.908571
596          597   7.980000
597          598   7.616364
598          599   8.822105

[599 rows x 2 columns]

### 6. 
What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [26]:
q_6= """SELECT customer.first_name, customer.last_name, COUNT(payment.amount) AS num_payments
        FROM customer
        JOIN payment ON customer.customer_id = payment.payment_id
        GROUP BY customer.first_name, customer.last_name
        ORDER BY num_payments DESC
        LIMIT 5;"""

pd.read_sql(q_6, engine)

  first_name last_name  num_payments
0       MARY     SMITH             1
1   PATRICIA   JOHNSON             1
2      LINDA  WILLIAMS             1
3    BARBARA     JONES             1
4  ELIZABETH     BROWN             1